results/fio/adrft/run2.log
write_throughput: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=psync, iodepth=64
...
fio-3.39-38-gf18c
Starting 16 processes
note: both iodepth >= 1 and synchronous I/O engine are selected, queue depth will be capped at 1
note: both iodepth >= 1 and synchronous I/O engine are selected, queue depth will be capped at 1
note: both iodepth >= 1 and synchronous I/O engine are selected, queue depth will be capped at 1
[...]

write_throughput: (groupid=0, jobs=16): err= 0: pid=2837672: Sun Apr 27 22:18:16 2025
  write: IOPS=514, BW=514MiB/s (539MB/s)(15.1GiB/30045msec); 0 zone resets
    clat (usec): min=3682, max=75883, avg=31045.89, stdev=2594.37
     lat (usec): min=3725, max=75933, avg=31089.82, stdev=2594.42
    clat percentiles (usec):
     |  1.00th=[23462],  5.00th=[31065], 10.00th=[31065], 20.00th=[31065],
     | 30.00th=[31065], 40.00th=[31065], 50.00th=[31065], 60.00th=[31065],
     | 70.00th=[31065], 80.00th=[31065], 90.00th=[31065], 95.00th=[31065],
     | 99.00th=[38011], 99.50th=[49021], 99.90th=[61080], 99.95th=[62129],
     | 99.99th=[71828]
   bw (  KiB/s): min=474350, max=571161, per=100.00%, avg=526989.86, stdev=1057.70, samples=945
   iops        : min=  451, max=  554, avg=506.95, stdev= 1.16, samples=945
  lat (msec)   : 4=0.01%, 10=0.14%, 20=0.50%, 50=98.87%, 100=0.49%
  cpu          : usr=0.20%, sys=0.40%, ctx=15570, majf=0, minf=581
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,15445,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
  WRITE: bw=514MiB/s (539MB/s), 514MiB/s-514MiB/s (539MB/s-539MB/s), io=15.1GiB (16.2GB), run=30045-30045msec

Disk stats (read/write):
  sdc: ios=0/16603, sectors=0/33769856, merge=0/103, ticks=0/511977, in_queue=512200, util=88.93%